[Killed] BlockStatement
src/price.js:1:40
-export function calculatePrice(amount) {
-    if (amount >= 100) {
-        return amount * 0.9;
-    }
-
-    return amount;
-}
+export function calculatePrice(amount) {}
killedBy: All tests
statusReason: Running 1 test using 1 worker



  x  1 tests\price.spec.js:4:1 › gibt Rabatt ab 100 Euro (5.2s)

[Killed] BlockStatement
src/price.js:2:24
 export function calculatePrice(amount) {
-    if (amount >= 100) {
-        return amount * 0.9;
-    }
+    if (amount >= 100) {}
 
     return amount;
killedBy: All tests
statusReason: Running 1 test using 1 worker



  x  1 tests\price.spec.js:4:1 › gibt Rabatt ab 100 Euro (5.2s)

[Killed] EqualityOperator
src/price.js:2:9
 export function calculatePrice(amount) {
-    if (amount >= 100) {
+    if (amount > 100) {
         return amount * 0.9;
     }
killedBy: All tests
statusReason: Running 1 test using 1 worker



  x  1 tests\price.spec.js:4:1 › gibt Rabatt ab 100 Euro (5.2s)

[Killed] ArithmeticOperator
src/price.js:3:16
 export function calculatePrice(amount) {
     if (amount >= 100) {
-        return amount * 0.9;
+        return amount / 0.9;
     }
 
killedBy: All tests
statusReason: Running 1 test using 1 worker



  x  1 tests\price.spec.js:4:1 › gibt Rabatt ab 100 Euro (5.2s)
